#Создать lambda функцию, которая принимает на вход имя и выводит его в формате "Hello {name}"
greeting = lambda name: f"Hello, {name}"

print(greeting("Boris"))